[Killed] PublicVisibility
Application/Service/DropFile/DropFile.php:19:5
     {
     }
 
-    public function execute(DropFileRequest $request): void
+    protected function execute(DropFileRequest $request): void
     {
         $fileName = new FileName($request->fileToDeposit);
killedBy: DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
statusReason: 1) DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
Error: Call to protected method DriveManager\Application\Service\DropFile\DropFile::execute() from scope DriveManager\Tests\Application\Service\DropFile\DropFileTest

/home/dev/work/DriveManager/tests/unit/Application/Service/DropFile/DropFileTest.php:23

2) DriveManager\Tests\Application\Service\DropFile\DropF

[Killed] MethodCallRemoval
Application/Service/DropFile/DropFile.php:26:9
         $fileContent = new FileContent($request->fileContent);
         $file = new File($fileName, $path, $fileContent);
 
-        $this->repository->add($file);
+        
         $this->dropFileApi->dropFile($file);
         $this->dropFileResponse = new DropFileResponse(
killedBy: DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
statusReason: 1) DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
Error: Typed property DriveManager\Infrastructure\Persistence\FileRepositoryInMemory::$files must not be accessed before initialization

/home/dev/work/DriveManager/src/Infrastructure/Persistence/FileRepositoryInMemory.php:24
/home/dev/work/DriveManager/tests/unit/Application/Service/DropFile/DropFileTest.php:2

[Killed] MethodCallRemoval
Application/Service/DropFile/DropFile.php:27:9
         $file = new File($fileName, $path, $fileContent);
 
         $this->repository->add($file);
-        $this->dropFileApi->dropFile($file);
+        
         $this->dropFileResponse = new DropFileResponse(
             $file->getId()->__toString(),
killedBy: DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
statusReason: 1) DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
Failed asserting that 0 matches expected 1.

/home/dev/work/DriveManager/tests/unit/Application/Service/DropFile/DropFileTest.php:32

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
Application/Service/DropFile/DropFile.php:36:5
         );
     }
 
-    public function getResponse(): DropFileResponse
+    protected function getResponse(): DropFileResponse
     {
         return $this->dropFileResponse;
killedBy: DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
statusReason: 1) DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
Error: Call to protected method DriveManager\Application\Service\DropFile\DropFile::getResponse() from scope DriveManager\Tests\Application\Service\DropFile\DropFileTest

/home/dev/work/DriveManager/tests/unit/Application/Service/DropFile/DropFileTest.php:24

2) DriveManager\Tests\Application\Service\DropFile\D
