[Killed] PublicVisibility
Domain/Model/File/File.php:20:5
         $this->date = new DateTimeImmutable();
     }
 
-    public function getFileName(): string
+    protected function getFileName(): string
     {
         return $this->fileName->getFileName();
killedBy: DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositAFileWithComplexPath
statusReason: 1) DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositAFileWithComplexPath
Error: Call to protected method DriveManager\Domain\Model\File\File::getFileName() from scope DriveManager\Tests\Application\Service\DropFile\DropFileApiVfs

/home/dev/work/DriveManager/tests/unit/Application/Service/DropFile/DropFileApiVfs.php:30
/home/dev/work/DriveManager/src/Application/Service/Dro

[Killed] PublicVisibility
Domain/Model/File/File.php:30:5
         return $this->content->getContent();
     }
 
-    public function getId(): FileId
+    protected function getId(): FileId
     {
         return $this->id;
killedBy: DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositAFileWithComplexPath
statusReason: 1) DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositAFileWithComplexPath
Error: Call to protected method DriveManager\Domain\Model\File\File::getid() from scope DriveManager\Infrastructure\Persistence\FileRepositoryInMemory

/home/dev/work/DriveManager/src/Infrastructure/Persistence/FileRepositoryInMemory.php:19
/home/dev/work/DriveManager/src/Application/Service/DropFile/D

[Killed] PublicVisibility
Domain/Model/File/File.php:35:5
         return $this->id;
     }
 
-    public function getDate(): DateTimeImmutable
+    protected function getDate(): DateTimeImmutable
     {
         return $this->date;
killedBy: DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
statusReason: 1) DriveManager\Tests\Application\Service\DropFile\DropFileTest::testDepositASimpleFile
Error: Call to protected method DriveManager\Domain\Model\File\File::getDate() from scope DriveManager\Application\Service\DropFile\DropFile

/home/dev/work/DriveManager/src/Application/Service/DropFile/DropFile.php:32
/home/dev/work/DriveManager/tests/unit/Application/Service/DropFile/DropFileTest.php:23

2) D

[Killed] PublicVisibility
Domain/Model/File/File.php:40:5
         return $this->date;
     }
 
-    public function getPath(): string
+    protected function getPath(): string
     {
         return $this->path; //->getPath().$this->fileName
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testDropOneFile
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testThrowExceptionRepositoryDoesntExiste
/home/dev/work/DriveManager/src/Infrastructure/DriveProvider/DropFileForFileSystem.php:20
/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:60
.

ERRORS!
Tests: 6, Assertions: 6, Errors: 1, Failures: 1.
