[Killed] PublicVisibility
Domain/Model/File/FileId.php:19:5
             return $this->id;
     }
 
-    public function equals(FileId $fileId): bool
+    protected function equals(FileId $fileId): bool
     {
         if ($this->id === $fileId->id) {
killedBy: DriveManager\Tests\Domain\FileIdTest::testIdentify2
statusReason: 1) DriveManager\Tests\Domain\FileIdTest::testIdentify2
Error: Call to protected method DriveManager\Domain\Model\File\FileId::equals() from scope DriveManager\Tests\Domain\FileIdTest

/home/dev/work/DriveManager/tests/unit/Domain/FileIdTest.php:20

2) DriveManager\Tests\Domain\FileIdTest::testIdentify
Error: Call to protected method DriveManager\Domain\Model\File\FileId::equals() from scope DriveM

[Killed] Identical
Domain/Model/File/FileId.php:21:9
 
     public function equals(FileId $fileId): bool
     {
-        if ($this->id === $fileId->id) {
+        if ($this->id !== $fileId->id) {
             return true;
         }
killedBy: DriveManager\Tests\Domain\FileIdTest::testIdentify
statusReason: 1) DriveManager\Tests\Domain\FileIdTest::testIdentify
Failed asserting that true is false.

/home/dev/work/DriveManager/tests/unit/Domain/FileIdTest.php:14

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] TrueValue
Domain/Model/File/FileId.php:22:13
     public function equals(FileId $fileId): bool
     {
         if ($this->id === $fileId->id) {
-            return true;
+            return false;
         }
         return false;
killedBy: DriveManager\Tests\Domain\FileIdTest::testIdentify2
statusReason: 1) DriveManager\Tests\Domain\FileIdTest::testIdentify2
Failed asserting that false is true.

/home/dev/work/DriveManager/tests/unit/Domain/FileIdTest.php:20

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
