[Killed] MethodCallRemoval
Domain/Model/File/Path.php:13:9
 
     public function __construct(string $path = '')
     {
-        $this->validatePath($path);
+        
         $this->path = $path;
     }
killedBy: DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
statusReason: 1) DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\IncompletePathException" is thrown.

FAILURES!
Tests: 22, Assertions: 33, Failures: 1.

[Killed] LogicalNot
Domain/Model/File/Path.php:24:9
 
     private function validatePath(string $path): void
     {
-        if ($this->isNextCloudPath($path) && !$this->isCompletePath($path)) {
+        if ($this->isNextCloudPath($path) && $this->isCompletePath($path)) {
             throw new IncompletePathException("NextCloud drive detect but seem incomplete. Please check path '$path'");
         }
killedBy: DriveManager\Tests\Domain\PathTest::testCorrectFileSystemButWithStrangeWord
statusReason: 1) DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\IncompletePathException" is thrown.

ERRORS!
Tests: 4, Assertions: 3, Errors: 1, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
Domain/Model/File/Path.php:24:9
 
     private function validatePath(string $path): void
     {
-        if ($this->isNextCloudPath($path) && !$this->isCompletePath($path)) {
+        if (!$this->isNextCloudPath($path) && !$this->isCompletePath($path)) {
             throw new IncompletePathException("NextCloud drive detect but seem incomplete. Please check path '$path'");
         }
killedBy: DriveManager\Tests\Domain\PathTest::testPathWithNextCloudStyle
statusReason: 1) DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\IncompletePathException" is thrown.

ERRORS!
Tests: 4, Assertions: 2, Errors: 2, Failures: 1.

[Killed] Throw_
Domain/Model/File/Path.php:25:13
     private function validatePath(string $path): void
     {
         if ($this->isNextCloudPath($path) && !$this->isCompletePath($path)) {
-            throw new IncompletePathException("NextCloud drive detect but seem incomplete. Please check path '$path'");
+            new IncompletePathException("NextCloud drive detect but seem incomplete. Please check path '{$path}'");
         }
     }
killedBy: DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
statusReason: 1) DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\IncompletePathException" is thrown.

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] LogicalOrNegation
Domain/Model/File/Path.php:31:9
 
     private function isNextCloudPath(string $path): bool
     {
-        return str_contains($path, 'owncloud') || str_contains($path, 'nextcloud');
+        return !(str_contains($path, 'owncloud') || str_contains($path, 'nextcloud'));
     }
 
killedBy: DriveManager\Tests\Domain\PathTest::testPathWithLinuxStyle
statusReason: 1) DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\IncompletePathException" is thrown.

ERRORS!
Tests: 4, Assertions: 2, Errors: 2, Failures: 1.

[Killed] LogicalOr
Domain/Model/File/Path.php:31:9
 
     private function isNextCloudPath(string $path): bool
     {
-        return str_contains($path, 'owncloud') || str_contains($path, 'nextcloud');
+        return str_contains($path, 'owncloud') && str_contains($path, 'nextcloud');
     }
 
killedBy: DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
statusReason: 1) DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\IncompletePathException" is thrown.

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] LogicalOrSingleSubExprNegation
Domain/Model/File/Path.php:36:9
 
     private function isCompletePath(string $path): bool
     {
-        return str_starts_with($path, 'https://') || str_starts_with($path, 'http://');
+        return str_starts_with($path, 'https://') || !str_starts_with($path, 'http://');
     }
 
killedBy: DriveManager\Tests\Domain\PathTest::testCorrectFileSystemButWithStrangeWord
statusReason: 1) DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\IncompletePathException" is thrown.

ERRORS!
Tests: 4, Assertions: 3, Errors: 1, Failures: 1.

[Killed] LogicalOrSingleSubExprNegation
Domain/Model/File/Path.php:36:9
 
     private function isCompletePath(string $path): bool
     {
-        return str_starts_with($path, 'https://') || str_starts_with($path, 'http://');
+        return !str_starts_with($path, 'https://') || str_starts_with($path, 'http://');
     }
 
killedBy: DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
statusReason: 1) DriveManager\Tests\Domain\PathTest::testDetectIncompleteNextCloudPathException
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\IncompletePathException" is thrown.

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.
