[Killed] LogicalNot
Infrastructure/DriveProvider/DropFileForFileSystem.php:22:9
     {
         $pathToUpload = $file->getPath();
         $pathRepository = sprintf(self::PATH_REPOSITORY, $this->rootPath, $pathToUpload);
-        if (!is_dir($pathRepository)) {
+        if (is_dir($pathRepository)) {
             throw new RepositoryDoesNotExistException("Repository ($pathToUpload) doesn't exist.");
         }
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testDropOneFile
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testThrowExceptionRepositoryDoesntExiste
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\RepositoryDoesNotExistException" is thrown.

ERRORS!
Tests: 3, Assertions: 3, Errors: 1, Failures: 1, Warnings: 1.

[Killed] Throw_
Infrastructure/DriveProvider/DropFileForFileSystem.php:23:13
         $pathToUpload = $file->getPath();
         $pathRepository = sprintf(self::PATH_REPOSITORY, $this->rootPath, $pathToUpload);
         if (!is_dir($pathRepository)) {
-            throw new RepositoryDoesNotExistException("Repository ($pathToUpload) doesn't exist.");
+            new RepositoryDoesNotExistException("Repository ({$pathToUpload}) doesn't exist.");
         }
 
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testThrowExceptionRepositoryDoesntExiste
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testThrowExceptionRepositoryDoesntExiste
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\RepositoryDoesNotExistException" is thrown.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1, Warnings: 1.

[Killed] FunctionCallRemoval
Infrastructure/DriveProvider/DropFileForFileSystem.php:27:9
         }
 
         $filePath = sprintf(self::FULL_PATH, $pathRepository, $file->getFileName());
-        file_put_contents($filePath, $file->getContent());
+        
     }
 
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testDropOneFile
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testDropOneFile
Failed asserting that false is true.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:37

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/DriveProvider/DropFileForFileSystem.php:32:9
 
     public function isFileExists(File $file): bool
     {
-        return file_exists($this->rootPath . '/' . $file->getFileName());
+        return file_exists($this->rootPath . '/');
     }
 
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testFileDoesntExiste
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testFileDoesntExiste
Failed asserting that true is false.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:49

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/DriveProvider/DropFileForFileSystem.php:32:9
 
     public function isFileExists(File $file): bool
     {
-        return file_exists($this->rootPath . '/' . $file->getFileName());
+        return file_exists('/' . $file->getFileName());
     }
 
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testDropOneFile
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testDropOneFile
Failed asserting that false is true.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:38

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Infrastructure/DriveProvider/DropFileForFileSystem.php:35:5
         return file_exists($this->rootPath . '/' . $file->getFileName());
     }
 
-    public function createDirectory(string $directoryName): void
+    protected function createDirectory(string $directoryName): void
     {
         $fullPath = $this->rootPath . '/' . $directoryName;
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testDropOneFile
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testDropOneFile
Error: Call to protected method DriveManager\Infrastructure\DriveProvider\DropFileForFileSystem::createDirectory() from scope DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:31

2)

[Killed] ConcatOperandRemoval
Infrastructure/DriveProvider/DropFileForFileSystem.php:37:9
 
     public function createDirectory(string $directoryName): void
     {
-        $fullPath = $this->rootPath . '/' . $directoryName;
+        $fullPath = $this->rootPath . '/';
         if (!is_dir($fullPath)) {
             mkdir($fullPath, 0777, true);
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectory
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectory
Failed asserting that false is true.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:70

FAILURES!
Tests: 4, Assertions: 8, Failures: 1.

[Killed] Concat
Infrastructure/DriveProvider/DropFileForFileSystem.php:37:9
 
     public function createDirectory(string $directoryName): void
     {
-        $fullPath = $this->rootPath . '/' . $directoryName;
+        $fullPath = $this->rootPath . $directoryName . '/';
         if (!is_dir($fullPath)) {
             mkdir($fullPath, 0777, true);
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectory
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectory
Failed asserting that false is true.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:70

FAILURES!
Tests: 4, Assertions: 8, Failures: 1.

[Killed] LogicalNot
Infrastructure/DriveProvider/DropFileForFileSystem.php:38:9
     public function createDirectory(string $directoryName): void
     {
         $fullPath = $this->rootPath . '/' . $directoryName;
-        if (!is_dir($fullPath)) {
+        if (is_dir($fullPath)) {
             mkdir($fullPath, 0777, true);
             //vfsStream::newDirectory($directoryName, 0777)->at(vfsStream::setup($this->rootPath));
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectory
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectory
Failed asserting that false is true.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:70

FAILURES!
Tests: 4, Assertions: 8, Failures: 1, Warnings: 1.

[Killed] FunctionCallRemoval
Infrastructure/DriveProvider/DropFileForFileSystem.php:39:13
     {
         $fullPath = $this->rootPath . '/' . $directoryName;
         if (!is_dir($fullPath)) {
-            mkdir($fullPath, 0777, true);
+            
             //vfsStream::newDirectory($directoryName, 0777)->at(vfsStream::setup($this->rootPath));
         }
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectory
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectory
Failed asserting that false is true.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:70

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] IncrementInteger
Infrastructure/DriveProvider/DropFileForFileSystem.php:39:13
     {
         $fullPath = $this->rootPath . '/' . $directoryName;
         if (!is_dir($fullPath)) {
-            mkdir($fullPath, 0777, true);
+            mkdir($fullPath, 512, true);
             //vfsStream::newDirectory($directoryName, 0777)->at(vfsStream::setup($this->rootPath));
         }
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectoryWithCorrectPermissions
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileForFileSystemTest::testCreateDirectoryWithCorrectPermissions
Failed asserting that 0 matches expected 511.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileForFileSystemTest.php:91

FAILURES!
Tests: 5, Assertions: 9, Failures: 1.
