[Killed] Equal
Infrastructure/DriveProvider/DropFileNextcloud.php:22:9
         string $password,
         ?HttpClientInterface $client = null
     ) {
-        if ($client == null) {
+        if ($client != null) {
             $this->client = (new HttpClientFactory())->create($baseUri, $mailAddress, $password);
         } else {
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
TypeError: Cannot assign null to property DriveManager\Infrastructure\DriveProvider\DropFileNextcloud::$client of type Symfony\Contracts\HttpClient\HttpClientInterface

/home/dev/work/DriveManager/src/Infrastructure/DriveProvider/DropFileNextcloud.php:19
/home/dev/work/DriveManager/tests/unit/Infrastructure/

[Killed] AssignmentEqual
Infrastructure/DriveProvider/DropFileNextcloud.php:22:9
         string $password,
         ?HttpClientInterface $client = null
     ) {
-        if ($client == null) {
+        if ($client = null) {
             $this->client = (new HttpClientFactory())->create($baseUri, $mailAddress, $password);
         } else {
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
TypeError: Cannot assign null to property DriveManager\Infrastructure\DriveProvider\DropFileNextcloud::$client of type Symfony\Contracts\HttpClient\HttpClientInterface

/home/dev/work/DriveManager/src/Infrastructure/DriveProvider/DropFileNextcloud.php:19
/home/dev/work/DriveManager/tests/unit/Infrastructure/

[Killed] ArrayItem
Infrastructure/DriveProvider/DropFileNextcloud.php:32:13
     public function dropFile(File $file): void
     {
         $requestOptions = [
-            'body' => $file->getContent()
+            $requestOptions = ['body' > $file->getContent()];
         ];
 
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropBody
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropBody
No valid request captured or missing "options" or "body" key.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileNextcloudTest.php:101

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Infrastructure/DriveProvider/DropFileNextcloud.php:37:9
 
         $response = $this->client->request('PUT', $file->getPath(), $requestOptions);
 
-        if (!in_array($response->getStatusCode(), self::SUCCESS_STATUS_CODES)) {
+        if (in_array($response->getStatusCode(), self::SUCCESS_STATUS_CODES)) {
             throw new FailUploadingFileException('Download failed : ' . $response->getStatusCode());
         }
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileSuccess
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\FailUploadingFileException" is thrown.

ERRORS!
Tests: 4, Assertions: 3, Errors: 1, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/DriveProvider/DropFileNextcloud.php:38:13
         $response = $this->client->request('PUT', $file->getPath(), $requestOptions);
 
         if (!in_array($response->getStatusCode(), self::SUCCESS_STATUS_CODES)) {
-            throw new FailUploadingFileException('Download failed : ' . $response->getStatusCode());
+            throw new FailUploadingFileException('Download failed : ');
         }
     }
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
Failed asserting that exception message 'Download failed : ' matches '/Download failed : \d{3}/'.

FAILURES!
Tests: 6, Assertions: 7, Failures: 1.

[Killed] Throw_
Infrastructure/DriveProvider/DropFileNextcloud.php:38:13
         $response = $this->client->request('PUT', $file->getPath(), $requestOptions);
 
         if (!in_array($response->getStatusCode(), self::SUCCESS_STATUS_CODES)) {
-            throw new FailUploadingFileException('Download failed : ' . $response->getStatusCode());
+            new FailUploadingFileException('Download failed : ' . $response->getStatusCode());
         }
     }
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
Failed asserting that exception of type "DriveManager\Application\Service\DropFile\Exceptions\FailUploadingFileException" is thrown.

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

[Killed] IncrementInteger
Infrastructure/DriveProvider/DropFileNextcloud.php:46:9
     {
         $response = $this->client->request('HEAD', $file->getPath());
 
-        return $response->getStatusCode() === 200;
+        return $response->getStatusCode() === 201;
     }
 
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileSuccess
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileSuccess
Failed asserting that false is true.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileNextcloudTest.php:74

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Infrastructure/DriveProvider/DropFileNextcloud.php:46:9
     {
         $response = $this->client->request('HEAD', $file->getPath());
 
-        return $response->getStatusCode() === 200;
+        return $response->getStatusCode() === 199;
     }
 
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileSuccess
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileSuccess
Failed asserting that false is true.

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileNextcloudTest.php:74

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Infrastructure/DriveProvider/DropFileNextcloud.php:49:5
         return $response->getStatusCode() === 200;
     }
 
-    public function readFile(File $file): string
+    protected function readFile(File $file): string
     {
 
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testReadAFile
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testReadAFile
Error: Call to protected method DriveManager\Infrastructure\DriveProvider\DropFileNextcloud::readFile() from scope DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest

/home/dev/work/DriveManager/tests/unit/Infrastructure/DriveProvider/DropFileNextcloudTest.php:143

ERRORS!
Tests: 6, Assertion
