[Killed] PublicVisibility
Infrastructure/DriveProvider/HttpClientFactory.php:10:5
 
 class HttpClientFactory
 {
-    public function create(string $baseUri, string $username, string $password): HttpClientInterface
+    protected function create(string $baseUri, string $username, string $password): HttpClientInterface
     {
         return HttpClient::create([
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileSuccess
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileSuccess
Error: Call to protected method DriveManager\Infrastructure\DriveProvider\HttpClientFactory::create() from scope DriveManager\Infrastructure\DriveProvider\DropFileNextcloud

/home/dev/work/DriveManager/src/Infrastructure/DriveProvider/DropFileNextcloud.php:23
/home/dev/work/DriveManager/tests/unit/Infrast

[Killed] ArrayItemRemoval
Infrastructure/DriveProvider/HttpClientFactory.php:12:9
 {
     public function create(string $baseUri, string $username, string $password): HttpClientInterface
     {
-        return HttpClient::create([
-            'base_uri' => $baseUri,
-            'auth_basic' => [$username, $password],
-            'headers' => [
-                'OCS-APIRequest' => 'true',
-                'Accept' => 'application/json',
-            ],
-        ]);
+        return HttpClient::create(['auth_basic' => [$username, $password], 'headers' => ['OCS-APIRequest' => 'true', 'Accept' => 'application/json']]);
     }
 }
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testIsFileExistsFalse
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\DropFileNextcloudTest::testDropFileFail
/home/dev/work/DriveManager/vendor/symfony/http-client/HttpClientTrait.php:565
/home/dev/work/DriveManager/vendor/symfony/http-client/HttpClientTrait.php:179
/home/dev/work/DriveManager/vendor/symfony/http-client/CurlHttpClient.php:100
/home/dev/work/DriveManager/src/Infrastructure/DriveProvider/DropFileNext

[Killed] ArrayItemRemoval
Infrastructure/DriveProvider/HttpClientFactory.php:14:13
     {
         return HttpClient::create([
             'base_uri' => $baseUri,
-            'auth_basic' => [$username, $password],
+            return HttpClient::create(['base_uri' => $baseUri, 'auth_basic' => [$password], 'headers' => ['OCS-APIRequest' => 'true', 'Accept' => 'application/json']]);
             'headers' => [
                 'OCS-APIRequest' => 'true',
killedBy: DriveManager\Tests\Infrastructure\DriveProvider\HttpClientFactoryTest::testCreate
statusReason: 1) DriveManager\Tests\Infrastructure\DriveProvider\HttpClientFactoryTest::testCreate
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'emailAddress:psw'
+'psw'
